MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK21DN512AVLK5/mcu.h
#define ENDP                          0x00000780      // Endpoint address
#define TX                            0x00000008      // Transmit indicator
#define ODD                           0x00000004      // Odd bank indicator


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_CTL register.
//
//*****************************************************************************

#define JSTATE                        0x00000080      // J-state signal
#define SE0                           0x00000040      // Single ended zero signal
#define TXSUSPENDTOKENBUSY            0x00000020      // Token busy signal
#define RESET                         0x00000010      // Reset signal
#define HOSTMODEEN                    0x00000008      // Host mode enable
#define RESUME                        0x00000004      // Resume signal
#define ODDRST                        0x00000002      // Odd bank reset
#define USBENSOFEN                    0x00000001      // USB enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ADDR register.
//
//*****************************************************************************

#define LSEN                          0x00000080      // Low speed enable
#define ADDR                          0x00001FC0      // USB address


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_BDTPAGE1 register.
//
//*****************************************************************************

#define BDTBA                         0x00003F80      // Buffer descriptor table base address


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_FRMNUML register.
//
//*****************************************************************************

#define FRM[7:0]                      0x00007F80      // Frame number


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_FRMNUMH register.
//
//*****************************************************************************

#define FRM[10:8]                     0x0000001C      // Frame number


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_TOKEN register.
//
//*****************************************************************************

#define TOKENPID                      0x00000780      // Token type
#define TOKENENDPT                    0x00000078      // Token endpoint


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_SOFTHLD register.
//
//*****************************************************************************

#define CNT                           0x00007F80      // SOF threshold count


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_BDTPAGE2 register.
//
//*****************************************************************************

#define BDTBA                         0x00007F80      // Buffer descriptor table base address


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_BDTPAGE3 register.
//
//*****************************************************************************

#define BDTBA                         0x00007F80      // Buffer descriptor table base address


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ENDPTn register.
//
//*****************************************************************************

#define HOSTWOHUB                     0x00000080      // Host without hub
#define RETRYDIS                      0x00000040      // Retry disable
#define EPCTLDIS                      0x00000010      // Endpoint control disable
#define EPRXEN                        0x00000008      // Endpoint receive enable
#define EPTXEN                        0x00000004      // Endpoint transmit enable
#define EPSTALL                       0x00000002      // Endpoint stall
#define EPHSHK                        0x00000001      // Endpoint handshake


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_USBCTRL register.
//
//*****************************************************************************

#define SUSP                          0x00000080      // Suspend
#define PDE                           0x00000040      // Pull-down enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_OBSERVE register.
//
//*****************************************************************************

#define DPPU                          0x00000080      // D+ pull-up
#define DPPD                          0x00000040      // D+ pull-down
#define DMPD                          0x00000010      // D- pull-down


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_CONTROL register.
//
//*****************************************************************************

#define DPPULLUPNONOTG                0x00000010      // D+ pull-up in non-OTG device mode


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_USBTRC0 register.
//
//*****************************************************************************

